Repository: johndcollins/F4ToPokeys
Catalog: F4ToPokeys/Translations/Main.*.resx
Languages: fr

# AddDigitalOutputButton
source: Add a digital output
fr: Ajouter une sortie digitale

# AddMatrixLedOutputButton
source: Add a matrix LED output
fr: Ajouter une sortie de matrice de LED

# AddPoExtBusOutputButton
source: Add a PoExtBus output
fr: Ajouter une sortie PoExtBus

# AddPoKeysButton
source: Add a PoKeys
fr: Ajouter une PoKeys

# AddPololuMaestroButton
source: Add a Pololu Maestro
fr: Ajouter une Pololu Maestro

# AddServoButton
source: Add a servo
fr: Ajouter un servo

# AddServoPointButton
source: Add a point
fr: Ajouter un point

# AddSevenSegmentDisplayButton
source: Add a 7 segment display
fr: Ajouter un afficheur 7 segments

# ApplicationStartedBalloonTip
source: F4ToPokeys started
fr: F4ToPokeys est démarré

# ConfigLoadErrorCaption
source: Configuration load error
fr: Erreur de lecture de la configuration

# ConfigSaveErrorCaption
source: Configuration save error
fr: Erreur de sauvegarde de la configuration

# DecrementTotalSizeButton
source: Remove a digit
fr: Supprimer un chiffre

# DigitalOutputConfigCaption
source: Digital output
fr: Sortie digitale

# DigitalOutputErrorBadIOType
source: This pin is not a digital output
fr: Cette entrée/sortie n'est pas une sortie digitale

# DigitalOutputErrorGetIOType
source: Pin IO type read error
fr: Erreur de lecture du type d'entrée/sortie

# DigitalOutputErrorWrite
source: Digital output write error
fr: Erreur d'écriture de la valeur de la sortie digitale

# FalconSamplingInterval
source: Falcon data sampling interval:
fr: Intervalle de lecture des données Falcon:

# FalconSamplingUnit
source: milliseconds
fr: millisecondes

# FractionalPartSizeCaption
source: Maximum digit number after decimal point
fr: Nombre maximum de chiffres après la virgule

# IncrementTotalSizeButton
source: Add a digit
fr: Ajouter un chiffre

# IntegralPartMinSizeCaption
source: Minimum digit number before decimal point
fr: Nombre minimum de chiffres avant la virgule

# MatrixLedErrorNotEnabled
source: This matrix LED display is not enabled
fr: Cette matrice de LED n'est pas activée

# MatrixLedErrorWrite
source: Matrix LED display write error
fr: Erreur d'écriture de la valeur de la matrice de LED

# MatrixLedOutputConfigCaption
source: Matrix LED output
fr: Sortie de matrice de LED

# MatrixLedOutputConfigColumn
source: Column
fr: Colonne

# MatrixLedOutputConfigRow
source: Row
fr: Ligne

# MatrixLedPixelErrorNotEnabled
source: This matrix LED output ({0}, {1}) is not enabled
fr: Cette sortie ({0}, {1}) de matrice de LED n'est pas activée

# MenuItemConfigure
source: Configure
fr: Configurer

# MenuItemQuit
source: Quit
fr: Quitter

# PadFractionalPartWithZeroCaption
source: Fixed size
fr: Taille fixe

# PoExtBusErrorNotEnabled
source: The PoExtBus is not enabled
fr: Le PoExtBus n'est pas activée

# PoExtBusErrorWrite
source: PoExtBus write error
fr: Erreur d'écriture de la valeur du PoExtBus

# PoExtBusOutputConfigCaption
source: PoExtBus output
fr: Sortie PoExtBus

# PoExtBusOutputConfigDevice
source: Device
fr: Périphérique

# PokeysConnectError
source: PoKeys connection error
fr: Erreur de connexion à la PoKeys

# PokeysNotFoundError
source: Not found
fr: Non trouvée

# PololuMaestroNotFoundError
source: Not found
fr: Non trouvée

# RemoveButton
source: Remove
fr: Supprimer

# RemoveDigitalOutputCaption
source: Remove digital output
fr: Supprimer une sortie digitale

# RemoveDigitalOutputText
source: Remove digital output {0} ?
fr: Supprimer la sortie digitale {0} ?

# RemoveMatrixLedOutputCaption
source: Remove matrix LED output
fr: Supprimer une sortie de matrice de LED

# RemoveMatrixLedOutputText
source: Remove matrix LED output ({1}, {2}) of {0} ?
fr: Supprimer la sortie ({1}, {2}) de la matrice de LED {0} ?

# RemovePoExtBusOutputCaption
source: Remove PoExtBus output
fr: Supprimer une sortie PoExtBus

# RemovePoExtBusOutputText
source: Remove PoExtBus output {1} of device {0} ?
fr: Supprimer la sortie PoExtBus {1} du périphérique {0} ?

# RemovePoKeysCaption
source: Remove PoKeys
fr: Supprimer une PoKeys

# RemovePoKeysText
source: Remove PoKeys {0} ?
fr: Supprimer la PoKeys {0} ?

# RemovePololuMaestroCaption
source: Remove Pololu Maestro
fr: Supprimer une Pololu Maestro

# RemovePololuMaestroText
source: Remove Pololu Maestro {0} ?
fr: Supprimer la Pololu Maestro {0} ?

# RemoveServoCaption
source: Remove Servo
fr: Supprimer un servo

# RemoveServoText
source: Remove Servo {0} ?
fr: Supprimer le servo {0} ?

# RemoveSevenSegmentDisplayCaption
source: Remove 7 segment display
fr: Supprimer un afficheur 7 segments

# RemoveSevenSegmentDisplayText
source: Remove 7 segment display {0} ?
fr: Supprimer l'afficheur 7 segments {0} ?

# ServoPointFalconValue
source: Falcon value
fr: Valeur Falcon

# ServoPointServoValue
source: Servo value
fr: Valeur Servo

# SevenSegmentDigitColumnCaption
source: Digit matrix LED column index
fr: Numéro de colonne du chiffre dans la matrice de LED

# SevenSegmentDigitRowCaption
source: Digit matrix LED row index
fr: Numéro de ligne du chiffre dans la matrice de LED

# SevenSegmentDisplayConfigCaption
source: 7 segment display
fr: Afficheur 7 segments

# SevenSegmentInvertRowColumnOption
source: Swap rows and columns of the matrix LED
fr: Echanger les lignes et les colonnes de la matrice de LED

# SevenSegmentSegmentColumnCaption
source: Segment matrix LED column index :
fr: Numéro de colonne du segment dans la matrice de LED :

# SevenSegmentSegmentRowCaption
source: Segment matrix LED row index :
fr: Numéro de ligne du segment dans la matrice de LED :
